Compiler.org
#+TITLE: Compiler
#+AUTHOR: wugouzi
#+LATEX_HEADER: \usepackage{tikz,qtree}
#+LATEX_HEADER: \usepackage{forest,syntax}
#+LATEX_HEADER: \input{preamble.tex}
#+LATEX_CLASS: article
#+EXPORT_FILE_NAME: latex/Compiler/Compiler.tex

* Chap1 introduction
  source code -> scanner -> [tokens] -> parser -> [syntax tree] -> semantic
  analyzer -> [annotated tree] -> source code optimizer -> [intermediate code]
  -> code generator -> [target code] -> target code optimizer -> [target code]

* chap2 scanning
  source code(*character stream*) -> *token stream*. Use regular expression.
  a ε R|S RS R* R+=R(R*) R?=(R|ε) [abce]=(a|b|c|e) [a-z] [^az]=anything but
  one of the listed chars

  comment "/*"([^*/]|[^*]"/"|"*"[^/])*"*/"

  finite automata

  Thompson's construction


  Minimizing the number of states in a DFA
  1. it begins with the most optimistic assumptions possible: it create two sets
     * one consisting of all the accepting states
     * the other consisting of all the nonaccepting states
  2. given this partition of the states of the original DFA, consider the
     transitions on *each character* a of the alphabet
     * if all accepting states have transitions on a to accepting states,
       defines an a-transition from the new accepting state to itself
     * if all accepting states have transitions on a to nonaccepting states ...
  3. given this partition of the states of the original DFA, consider the
     transitions on each character a of the alphabet
     * if there are two accepting states s and t that have transitions on a that
       land in different sets, no a-transition can be defined for this grouping
       of the states. a distinguish the states s and t
     * if there are two accpeting states s and t s.t. s has an a-transition to
       another accepting state, while t has no a-transition at all. a
       distinguish s and t

* Chap3 context-free grammars and parsing
** context-free grammars
   A context-free grammar involves recursion rules. 4-tuple $(V,\Sigma,S,\to)$.
   V nonterminal. Σ terminal. S start symbol. $\to\subset
   V\times(V\cup\Sigma)*$

   *Left recursive*: the nonterminal A appears as the first symbol on the
   right-hand side of the rule defining A

   *Right recusive*:

   *ε-production*: empty->ε
   A grammar that generates a language containing the empty string must have at
   least one *ε-production*
** Parse tree and abstract syntax trees
*** parse tree
    A *parse tree* corresponding to a derivation is a labeled tree
      * the interior nodes are labeled by *nonterminals*
      * the leaf is *terminals*

    *left-most derivation*
*** abstract symtax tree
    \begin{forest}
    [+ [3] [4] ]
    \end{forest}
** Ambiguity
*** ambiguity grammars
   *ambiguous grammar*: a grammar that generates a string with two distinct parse
   trees

   Two basic methods:
   1. A rule: that specifies in each ambiguous case which of the parse trees is
      the correct one. *disambbiguating rule*
      * associativity
   2. change the grammar
*** precedence and associativity
    A /left recursive/ rule makes its operators associate on the left
*** the dangling else problem
    \begin{grammar}
    <statement> ::= <if-stmt>
    \alt `other'

    <if-stmt> ::= `if' `(' <exp> `)' <statement>
    \alt `if' `(' <exp> `)' <statement> `else' <statement>
    \end{grammar}

    disambiguating rule is *most closely nested rule*.
    grammar is
    \begin{grammar}
    <statement> -> <matched-stmt>
    \alt <unmatched-stmt>

    <matched-stmt> -> `if' `(' <exp> `)' <matched-stmt> `else' <matched-stmt>
    \alt `other'

    <unmatched-stmt> -> `if' `(' <exp> `)' <statement>
    \alt `if' `(' <exp> `)' <matched-stmt> `else' <unmatched-stmt>

    <exp> -> `0'
    \alt `1'
    \end{grammar}
*** inessential ambiguity
    sometimes a grammar may be ambiguous and yet always produce unique /abstract/
    /syntax tree/.

    *inessential ambiguity*: the associated semantics don't depend on what
     disambiguating rule is used
*** extended notations: EBNF and syntax diagrams
    $A\to A\;\alpha\mid\beta\Longrightarrow A\to\beta\;\{\alpha\}$.
    $A\to\alpha\; A\mid\beta\Longrightarrow A\to\{\alpha\}\;\beta$
** Formal properties of context-free language
   A context-free grammar consists of the following
   1. T terminals
   2. N nonterminals
   3. P grammar rules
   4. S start symbol

   *sentential form* a string a in $(T\cup N)*$

   A grammar G is *ambiguous* if there exists a string $w\in L(G)$ s.t. w has two
   distinct parse trees

* Chap4 top-down parsing
** Top-down parsing by recursive-descent
   not easy and use EBNF
   \begin{grammar}
   <if-stmt> ::= `if' `(' <exp> `)' <statement>
   \alt `if' `(' <exp> `)' <statement> `else' <statement>
   \end{grammar} to if-stmt -> if (exp) statement [else statement]
** LL(1) parsing
   use an explicit stack rather than recursive calls.
   \begin{grammar}
   <S> ::= <E> `+' <S>
   \alt <E>

   <E> ::= `num'
   \alt `(' <S> `)'
   \end{grammar}.
   | partly-derived string | lookahead | parsed part | unparsed part |
   |-----------------------+-----------+-------------+---------------|
   | S                     |         ( |             | (1+2+(3+4))+5 |
   | E+S                   |         ( |             | (1+2+(3+4))+5 |
   | (S)+S                 |         1 | (           |  1+2+(3+4))+5 |
   | (E+S)+S               |         1 | (           |  1+2+(3+4))+5 |
   | (1+S)+S               |         2 | (1+         |    2+(3+4))+5 |
   | (1+E+S)+S             |         2 | (1+         |    2+(3+4))+5 |
   | (1+2+S)+S             |         ( | (1+2+(      |      (3+4))+5 |

   For $S\to(S)\; S\mid\epsilon$
   | step | parsing | input | action  |
   |------+---------+-------+---------|
   |    1 | $S      | ()$   | S->(S)S |
   |    2 | $S)S(   | ()$   | match   |
   |    3 | $S)S    | )$    | S->e    |
   |    4 | $S)     | )$    | match   |
   |    5 | $S      | $     | S->e    |
   |    6 | $       | $     | match   |

   Two actions:
   1. generate
   2. match: match a token on top of the stack with the next input token

   This corresponds to the leftmost derivation. *characteristic of top-down
   parsing*
*** LL(1) parsing table
   parsing table
   | M[N,T] | (       | )    | $    |
   |--------+---------+------+------|
   | S      | S->(S)S | S->e | S->e |

   M is the set of non-terminals.
   T is the set of terminals or tokens including $

   Table-constructing rule:
   1. if $A\to\alpha$ is a production choice and there is a derivation
      $\alpha\Rightarrow*a\beta$ where a is a token then add $A\to\alpha$ to
      M[A,a]
   2. if $A\to\alpha$ and
      $\alpha\Rightarrow*\epsilon,S\textdollar\textsterling\Rightarrow^*\beta
      Aa\gamma$, where S is the start symbol and a is a token(or $), then add
      $A\to\alpha$ to M[A,a]

   A grammar is LL(1) if LL(1) parsing table has at most one production in each entry
