latex/Compiler/Compiler.tex
% Created 2019-04-28 日 14:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{tikz,qtree}
\usepackage{forest,syntax}
\input{../preamble.tex}
\author{wugouzi}
\date{\today}
\title{Compiler}
\hypersetup{
 pdfauthor={wugouzi},
 pdftitle={Compiler},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Chap1 introduction}
\label{sec:orga06e29d}
source code -> scanner -> [tokens] -> parser -> [syntax tree] -> semantic
analyzer -> [annotated tree] -> source code optimizer -> [intermediate code]
-> code generator -> [target code] -> target code optimizer -> [target code]

\section{chap2 scanning}
\label{sec:orgb50eafe}
source code(\textbf{character stream}) -> \textbf{token stream}. Use regular expression.
a ε R|S RS R* R+=R(R*) R?=(R|ε) [abce]=(a|b|c|e) [a-z] [\(^{\text{az}}\)]=anything but
one of the listed chars

comment "\emph{*"([\(^{\text{*}}\)/]|[\(^{\text{*}}\)]"}"|"\textbf{"[\^{}/])}"*/"

finite automata

Thompson's construction


Minimizing the number of states in a DFA
\begin{enumerate}
\item it begins with the most optimistic assumptions possible: it create two sets
\begin{itemize}
\item one consisting of all the accepting states
\item the other consisting of all the nonaccepting states
\end{itemize}
\item given this partition of the states of the original DFA, consider the
transitions on \textbf{each character} a of the alphabet
\begin{itemize}
\item if all accepting states have transitions on a to accepting states,
defines an a-transition from the new accepting state to itself
\item if all accepting states have transitions on a to nonaccepting states \ldots{}
\end{itemize}
\item given this partition of the states of the original DFA, consider the
transitions on each character a of the alphabet
\begin{itemize}
\item if there are two accepting states s and t that have transitions on a that
land in different sets, no a-transition can be defined for this grouping
of the states. a distinguish the states s and t
\item if there are two accpeting states s and t s.t. s has an a-transition to
another accepting state, while t has no a-transition at all. a
distinguish s and t
\end{itemize}
\end{enumerate}

\section{Chap3 context-free grammars and parsing}
\label{sec:orga6c4681}
\subsection{context-free grammars}
\label{sec:org121046c}
A context-free grammar involves recursion rules. 4-tuple \((V,\Sigma,S,\to)\).
V nonterminal. Σ terminal. S start symbol. \(\to\subset
   V\times(V\cup\Sigma)*\)

\textbf{Left recursive}: the nonterminal A appears as the first symbol on the
right-hand side of the rule defining A

\textbf{Right recusive}:

\textbf{ε-production}: empty->ε
A grammar that generates a language containing the empty string must have at
least one \textbf{ε-production}
\subsection{Parse tree and abstract syntax trees}
\label{sec:org2ba0be9}
\subsubsection{parse tree}
\label{sec:org93095e0}
A \textbf{parse tree} corresponding to a derivation is a labeled tree
\begin{itemize}
\item the interior nodes are labeled by \textbf{nonterminals}
\item the leaf is \textbf{terminals}
\end{itemize}

\textbf{left-most derivation}
\subsubsection{abstract symtax tree}
\label{sec:orgff1d794}
\begin{forest}
[+ [3] [4] ]
\end{forest}
\subsection{Ambiguity}
\label{sec:orga628289}
\subsubsection{ambiguity grammars}
\label{sec:orgef52eb2}
\textbf{ambiguous grammar}: a grammar that generates a string with two distinct parse
trees

Two basic methods:
\begin{enumerate}
\item A rule: that specifies in each ambiguous case which of the parse trees is
the correct one. \textbf{disambbiguating rule}
\begin{itemize}
\item associativity
\end{itemize}
\item change the grammar
\end{enumerate}
\subsubsection{precedence and associativity}
\label{sec:orgfa75e10}
A \emph{left recursive} rule makes its operators associate on the left
\subsubsection{the dangling else problem}
\label{sec:org177a2ff}
\begin{grammar}
<statement> ::= <if-stmt>
\alt `other'

<if-stmt> ::= `if' `(' <exp> `)' <statement>
\alt `if' `(' <exp> `)' <statement> `else' <statement>
\end{grammar}

disambiguating rule is \textbf{most closely nested rule}.
grammar is
\begin{grammar}
<statement> -> <matched-stmt>
\alt <unmatched-stmt>

<matched-stmt> -> `if' `(' <exp> `)' <matched-stmt> `else' <matched-stmt>
\alt `other'

<unmatched-stmt> -> `if' `(' <exp> `)' <statement>
\alt `if' `(' <exp> `)' <matched-stmt> `else' <unmatched-stmt>

<exp> -> `0'
\alt `1'
\end{grammar}
\subsubsection{inessential ambiguity}
\label{sec:orgd6bbe6e}
sometimes a grammar may be ambiguous and yet always produce unique \emph{abstract}
\emph{syntax tree}.

\textbf{inessential ambiguity}: the associated semantics don't depend on what
 disambiguating rule is used
\subsubsection{extended notations: EBNF and syntax diagrams}
\label{sec:org7acd515}
\(A\to A\;\alpha\mid\beta\Longrightarrow A\to\beta\;\{\alpha\}\).
\(A\to\alpha\; A\mid\beta\Longrightarrow A\to\{\alpha\}\;\beta\)
\subsection{Formal properties of context-free language}
\label{sec:org127a5bf}
A context-free grammar consists of the following
\begin{enumerate}
\item T terminals
\item N nonterminals
\item P grammar rules
\item S start symbol
\end{enumerate}

\textbf{sentential form} a string a in \((T\cup N)*\)

A grammar G is \textbf{ambiguous} if there exists a string \(w\in L(G)\) s.t. w has two
distinct parse trees

\section{Chap4 top-down parsing}
\label{sec:orgdaed732}
\subsection{Top-down parsing by recursive-descent}
\label{sec:org594e27d}
not easy and use EBNF
\begin{grammar}
<if-stmt> ::= `if' `(' <exp> `)' <statement>
\alt `if' `(' <exp> `)' <statement> `else' <statement>
\end{grammar} to if-stmt -> if (exp) statement [else statement]
\subsection{LL(1) parsing}
\label{sec:org1793dbd}
use an explicit stack rather than recursive calls.
\begin{grammar}
<S> ::= <E> `+' <S>
\alt <E>

<E> ::= `num'
\alt `(' <S> `)'
\end{grammar}.
\begin{center}
\begin{tabular}{lrlr}
partly-derived string & lookahead & parsed part & unparsed part\\
\hline
S & ( &  & (1+2+(3+4))+5\\
E+S & ( &  & (1+2+(3+4))+5\\
(S)+S & 1 & ( & 1+2+(3+4))+5\\
(E+S)+S & 1 & ( & 1+2+(3+4))+5\\
(1+S)+S & 2 & (1+ & 2+(3+4))+5\\
(1+E+S)+S & 2 & (1+ & 2+(3+4))+5\\
(1+2+S)+S & ( & (1+2+( & (3+4))+5\\
\end{tabular}
\end{center}

For \(S\to(S)\; S\mid\epsilon\)
\begin{center}
\begin{tabular}{rlll}
step & parsing & input & action\\
\hline
1 & \$S & ()\$ & S->(S)S\\
2 & \$S)S( & ()\$ & match\\
3 & \$S)S & )\$ & S->e\\
4 & \$S) & )\$ & match\\
5 & \$S & \$ & S->e\\
6 & \$ & \$ & match\\
\end{tabular}
\end{center}

Two actions:
\begin{enumerate}
\item generate
\item match: match a token on top of the stack with the next input token
\end{enumerate}

This corresponds to the leftmost derivation. \textbf{characteristic of top-down
parsing}
\subsubsection{LL(1) parsing table}
\label{sec:org7ed8c18}
parsing table
\begin{center}
\begin{tabular}{llll}
M[N,T] & ( & ) & \$\\
\hline
S & S->(S)S & S->e & S->e\\
\end{tabular}
\end{center}

M is the set of non-terminals.
T is the set of terminals or tokens including \$

Table-constructing rule:
\begin{enumerate}
\item if \(A\to\alpha\) is a production choice and there is a derivation
\(\alpha\Rightarrow*a\beta\) where a is a token then add \(A\to\alpha\) to
M[A,a]
\item if \(A\to\alpha\) and
\(\alpha\Rightarrow*\epsilon,S\textdollar\textsterling\Rightarrow^*\beta
      Aa\gamma\), where S is the start symbol and a is a token(or \$), then add
\(A\to\alpha\) to M[A,a]
\end{enumerate}

A grammar is LL(1) if LL(1) parsing table has at most one production in each entry
