Compiler.org
*** left recursion removal and left factoring
    *left recursion removal*
       * *immediate left recursion*: $exp\to exp\;+\;term|exp\;-\;term|term$
       * *indirect left recursion*: $A\to Bb$ and $B\to Aa$


    1. Simple immediate left recursion.
       $A\to A\alpha|\beta$ to $A\to\beta\;A'$ and $A'\to\alpha\;A'|\epsilon$
    2. general immediate left recursion.
       $A\to A\alpha_1|\dots|A\alpha_n|\beta_1|\dots|\beta_m$ to
       $A\to\beta_1A'|\dots|\beta_mA'$ and
       $A'\to\alpha_1A'|\dots|\alpha_nA'|\epsilon$
    3. general left recursion. grammars with no $\epsilon$-productions and no cycles
       

    doesn't change language, but changes the grammar and parse tree

    *left factoring*.
    $A\to\alpha\beta|\alpha\gamma$ to $A\to\alpha A'$ and $A'\to\beta\mid\gamma$
*** Syntax tree construction in LL(1) parsing
** First and follow sets
   X a grammar symbol(a terminal or non-terminal) or $\epsilon$. Then First(X)
   is 
   1. if X is a terminal or $\epsilon$, then First(X)={X}
   2. if X is a non-terminal, for each $X\to X_1X_2\dots X_n$, First(X) contains
      First(X1) - {e}

   A non-terminal A is *nullable* iff there exists $A\Rightarrow^*\epsilon$ iff
   First(A) contains $\epsilon$

   Follow(A) is 
   1. if A is start symbol, $ is in Follow(A)
   2. if $B\to\alpha A\gamma$, then
      $\text{First}(\gamma)-\{\epsilon\}\subseteq\text{Follow}(A)$ 
   3. if $B\to\alpha A\gamma, \epsilon\in\text{First}(\gamma)$, then Follow(A)
      contains Follow(B)
** Error recovery in top-down parsers
* Chap5 Bottom-up parsing
** Overview of bottom-up parsing  
   + A bottom-up parser uses an *explicit stack* to perform a parse
   + The parsing stack will contain both tokens and nonterminals
     | $            | inputstring $ |
     |--------------+---------------|
     | ...          | ...           |
     | $StartSymbol | $accept       |
   + *right-most* derivation -- backward
     start with the tokens; end with the start symbol
     | (1+2+(3+4))+5 |
     | (E+2+(3+4))+5 |
     | (S+2+(3+4))+5 |
     | (S+E+(3+4))+5 |
     | (S+(3+4))+5   |
     | (S+(E+4))+5   |
     | (S+(S+4))+5   |
     | (S+(S+E))+5   |
     | (S+(S))+5     |
     | (S+E)+5       |
     | (S)+5         |
     | E+5           |
     | S+5           |
     | S+E           |
     | S             |
   + *parsing actions*: a sequence of *shift* and *reduce* operations
     *parser state*: a stack of terminals and non-terminals
     *current derivation step* = always stack + input
     | derivation    | step stack | unconsumed input |
     |---------------+------------+------------------|
     |               |            |              <r> |
     | (1+2+(3+4))+5 |            |    (1+2+(3+4))+5 |
     |               | (          |     1+2+(3+4))+5 |
     | (E+2+(3+4))+5 | (E         |      +2+(3+4))+5 |
     | (S+2+(3+4))+5 | (S         |      +2+(3+4))+5 |
     |               | (S+        |       2+(3+4))+5 |
     |               | (S+2       |        +(3+4))+5 |
     | (S+E+(3+4))+5 | (S+E       |        +(3+4))+5 |
   + 1. *shift*: shift a terminal from the front of the input to the top of the
     stack 
     1. *reduce*: reduce a string α at the top of the stack to a nonterminal A,
        given the BNF choice A ⟶ α
        
     A bottom-up parser: *shift-reduce parser*
   + One further feature of bottom-up parsers： grammars are always augmented
     with a *new start symbol*. if S is the start symbol, a new start symbol S' is
     added to the grammar :  S' →S   

   + example

     S'->S
     
     S ->(S)S|e

     S'=>S=>(S)S=>(S)=>()
     |   | Parsing stack | Input | Action             |
     |---+---------------+-------+--------------------|
     |   |               |   <r> |                    |
     | 1 | $             | ( ) $ | Shift              |
     | 2 | $ (           |   ) $ | Reduce  S -> ε    |
     | 3 | $ (S          |   ) $ | Shift              |
     | 4 | $ (S )        |     $ | Reduce  S -> ε    |
     | 5 | $ (S ) S      |     $ | Reduce S --> (S) S |
     | 6 | $S            |     $ | Reduce S'--> S     |
     | 7 | $S'           |     $ | Accept             |

   + example

     E'->E

     E->E+n|n

     E'=>E=>E+n=>n+n
     |   | Parsing stack | Input | Action        |
     |   |               |   <r> |               |
     | 1 | $             |  n+n$ | Shift         |
     | 2 | $n            |   +n$ | Reduce  E->n  |
     | 3 | $E            |   +n$ | Shift         |
     | 4 | $E+           |    n$ | Shift         |
     | 5 | $E+n          |     $ | Reduce E->E+n |
     | 6 | $E            |     $ | Reduce E'->E  |
     | 7 | $E'           |     $ | Accept        |
   + Right sentential form ::
     + A *sentential* form is any string derivable from the start symbol. Note
       that this includes the forms with non-terminals at intermediate steps as
       well. 
     + A *right-sentential form* is a sentential form that occurs in a step of
       rightmost derivation (RMD). 
       Each of the intermediate strings of terminals and nonterminals in such
       a derivation is called a right sentential form
       Each such sentential form is split between the parsing stack and the input
       during a shift-reduce parse
     + A *sentence* is a sentential form consisting only of terminals
       
     E,E+,E+n are *viable prefixes* of the right sentential form E+n.
     The sequence of symbols on the parsing stack is called *viable prefix* of the
     right sentential form
   + *handle*
     This string, together with the *position* in the right sentential form where it
     occurs, and the production used to reduced it, is called the *handle* of the right
     sentential form

     _determining the next handle in a parse is the main task of a shift-reduce parser_
** Finite automata of LR(0) items and LR(0) parsing
   + An *LR(0) item* of a context-free grammar: a production choice with a
     distinguished position in its right-hand side
   + If *A -> α*, *βγ = α*, then *A -> β · γ* is an LR(0) item
   + Example
     | S' -> S       |
     | S -> (S)S \ e |
     | S' -> ·S      |
     | S' -> S·      |
     | S -> ·(S)S    |
     | S -> (·S)S    |
     | S -> (S·)S    |
     | S -> (S)·S    |
     | S -> (S)S·    |
     | S -> ·        |
*** Finite automata of items
    + The LR(0) items: as the state of a finite automata
    + construct the DFA of sets of LR(0) using the subset construction from NFA
    + If X is a token or a nonterminal

      \begin{tikzpicture}
      [place/.style={circle,minimum size=5mm}]
      \node (x1) at (0,0) [place] {$A\to\alpha\cdot X\eta$};
      \node (x2) at (5,0) [place] {$A\to\alpha X\cdot\eta$};
      \draw [->] (x1) to node [above] {X} (x2);
      \end{tikzpicture}
    + If X is a token, then this transition corresponds to a shift of X from the
      input to the top of the stack during a parse
    + if X is a nonterminal,
      X will never appear as an input symbol

      \begin{tikzpicture}
      \node (x1) at (0,0) [circle] {$A\to\alpha\cdot X\eta$};
      \node (x2) at (5,0) [circle] {$X\to\cdot\beta$};
      \draw [->] (x1) to node [above] {$\epsilon$} (x2);
      \end{tikzpicture}
    + The *start state* of the NFA ↔ the *initial state* of the parser: the stack is
      empty
    + the solution is to augment the grammar by a single production S' -> S
    + *S'->·S* the *start state* of the NFA
