latex/Compiler/Compiler.tex
\subsubsection{left recursion removal and left factoring}
\label{sec:org31dd705}
\textbf{left recursion removal}
\begin{itemize}
\item \textbf{immediate left recursion}: \(exp\to exp\;+\;term|exp\;-\;term|term\)
\item \textbf{indirect left recursion}: \(A\to Bb\) and \(B\to Aa\)
\end{itemize}


\begin{enumerate}
\item Simple immediate left recursion.
\(A\to A\alpha|\beta\) to \(A\to\beta\;A'\) and \(A'\to\alpha\;A'|\epsilon\)
\item general immediate left recursion.
\(A\to A\alpha_1|\dots|A\alpha_n|\beta_1|\dots|\beta_m\) to
\(A\to\beta_1A'|\dots|\beta_mA'\) and
\(A'\to\alpha_1A'|\dots|\alpha_nA'|\epsilon\)
\item general left recursion. grammars with no \$\(\epsilon\)\$-productions and no cycles
\end{enumerate}


doesn't change language, but changes the grammar and parse tree

\textbf{left factoring}.
\(A\to\alpha\beta|\alpha\gamma\) to \(A\to\alpha A'\) and \(A'\to\beta\mid\gamma\)
\subsubsection{Syntax tree construction in LL(1) parsing}
\label{sec:org0e5e34a}
\subsection{First and follow sets}
\label{sec:org8ecca6d}
X a grammar symbol(a terminal or non-terminal) or \(\epsilon\). Then First(X)
is 
\begin{enumerate}
\item if X is a terminal or \(\epsilon\), then First(X)=\{X\}
\item if X is a non-terminal, for each \(X\to X_1X_2\dots X_n\), First(X) contains
First(X1) - \{e\}
\end{enumerate}

A non-terminal A is \textbf{nullable} iff there exists \(A\Rightarrow^*\epsilon\) iff
First(A) contains \(\epsilon\)

Follow(A) is 
\begin{enumerate}
\item if A is start symbol, \$ is in Follow(A)
\item if \(B\to\alpha A\gamma\), then
\(\text{First}(\gamma)-\{\epsilon\}\subseteq\text{Follow}(A)\)
\item if \(B\to\alpha A\gamma, \epsilon\in\text{First}(\gamma)\), then Follow(A)
contains Follow(B)
\end{enumerate}
\subsection{Error recovery in top-down parsers}
\label{sec:org8947007}
\section{Chap5 Bottom-up parsing}
\label{sec:orgc53315a}
\subsection{Overview of bottom-up parsing}
\label{sec:orgb206224}
\begin{itemize}
\item A bottom-up parser uses an \textbf{explicit stack} to perform a parse
\item The parsing stack will contain both tokens and nonterminals
\begin{center}
\begin{tabular}{ll}
\$ & inputstring \$\\
\hline
\ldots{} & \ldots{}\\
\$StartSymbol & \$accept\\
\end{tabular}
\end{center}
\item \textbf{right-most} derivation -- backward
start with the tokens; end with the start symbol
\begin{center}
\begin{tabular}{l}
(1+2+(3+4))+5\\
(E+2+(3+4))+5\\
(S+2+(3+4))+5\\
(S+E+(3+4))+5\\
(S+(3+4))+5\\
(S+(E+4))+5\\
(S+(S+4))+5\\
(S+(S+E))+5\\
(S+(S))+5\\
(S+E)+5\\
(S)+5\\
E+5\\
S+5\\
S+E\\
S\\
\end{tabular}
\end{center}
\item \textbf{parsing actions}: a sequence of \textbf{shift} and \textbf{reduce} operations
\textbf{parser state}: a stack of terminals and non-terminals
\textbf{current derivation step} = always stack + input
\begin{center}
\begin{tabular}{llr}
derivation & step stack & unconsumed input\\
\hline
(1+2+(3+4))+5 &  & (1+2+(3+4))+5\\
 & ( & 1+2+(3+4))+5\\
(E+2+(3+4))+5 & (E & +2+(3+4))+5\\
(S+2+(3+4))+5 & (S & +2+(3+4))+5\\
 & (S+ & 2+(3+4))+5\\
 & (S+2 & +(3+4))+5\\
(S+E+(3+4))+5 & (S+E & +(3+4))+5\\
\end{tabular}
\end{center}
\item 1. \textbf{shift}: shift a terminal from the front of the input to the top of the
stack 
\begin{enumerate}
\item \textbf{reduce}: reduce a string α at the top of the stack to a nonterminal A,
given the BNF choice A ⟶ α
\end{enumerate}

A bottom-up parser: \textbf{shift-reduce parser}
\item One further feature of bottom-up parsers： grammars are always augmented
with a \textbf{new start symbol}. if S is the start symbol, a new start symbol S' is
added to the grammar :  S' →S

\item example

S'->S

S ->(S)S|e

S'=>S=>(S)S=>(S)=>()
\begin{center}
\begin{tabular}{rlrl}
 & Parsing stack & Input & Action\\
\hline
1 & \$ & ( ) \$ & Shift\\
2 & \$ ( & ) \$ & Reduce  S -> ε\\
3 & \$ (S & ) \$ & Shift\\
4 & \$ (S ) & \$ & Reduce  S -> ε\\
5 & \$ (S ) S & \$ & Reduce S --> (S) S\\
6 & \$S & \$ & Reduce S'--> S\\
7 & \$S' & \$ & Accept\\
\end{tabular}
\end{center}

\item example

E'->E

E->E+n|n

E'=>E=>E+n=>n+n
\begin{center}
\begin{tabular}{rlrl}
 & Parsing stack & Input & Action\\
1 & \$ & n+n\$ & Shift\\
2 & \$n & +n\$ & Reduce  E->n\\
3 & \$E & +n\$ & Shift\\
4 & \$E+ & n\$ & Shift\\
5 & \$E+n & \$ & Reduce E->E+n\\
6 & \$E & \$ & Reduce E'->E\\
7 & \$E' & \$ & Accept\\
\end{tabular}
\end{center}
\item[{Right sentential form}] \begin{itemize}
\item A \textbf{sentential} form is any string derivable from the start symbol. Note
that this includes the forms with non-terminals at intermediate steps as
well.
\item A \textbf{right-sentential form} is a sentential form that occurs in a step of
rightmost derivation (RMD). 
Each of the intermediate strings of terminals and nonterminals in such
a derivation is called a right sentential form
Each such sentential form is split between the parsing stack and the input
during a shift-reduce parse
\item A \textbf{sentence} is a sentential form consisting only of terminals
\end{itemize}

E,E+,E+n are \textbf{viable prefixes} of the right sentential form E+n.
The sequence of symbols on the parsing stack is called \textbf{viable prefix} of the
right sentential form
\item \textbf{handle}
This string, together with the \textbf{position} in the right sentential form where it
occurs, and the production used to reduced it, is called the \textbf{handle} of the right
sentential form

\uline{determining the next handle in a parse is the main task of a shift-reduce parser}
\end{itemize}
\subsection{Finite automata of LR(0) items and LR(0) parsing}
\label{sec:org1520476}
\begin{itemize}
\item An \textbf{LR(0) item} of a context-free grammar: a production choice with a
distinguished position in its right-hand side
\item If \textbf{A -> α}, \textbf{βγ = α}, then \textbf{A -> β · γ} is an LR(0) item
\item Example
\begin{center}
\begin{tabular}{l}
S' -> S\\
S -> (S)S $\backslash$ e\\
S' -> ·S\\
S' -> S·\\
S -> ·(S)S\\
S -> (·S)S\\
S -> (S·)S\\
S -> (S)·S\\
S -> (S)S·\\
S -> ·\\
\end{tabular}
\end{center}
\end{itemize}
\subsubsection{Finite automata of items}
\label{sec:org69205ae}
\begin{itemize}
\item The LR(0) items: as the state of a finite automata
\item construct the DFA of sets of LR(0) using the subset construction from NFA
\item If X is a token or a nonterminal

\begin{tikzpicture}
[place/.style={circle,minimum size=5mm}]
\node (x1) at (0,0) [place] {$A\to\alpha\cdot X\eta$};
\node (x2) at (5,0) [place] {$A\to\alpha X\cdot\eta$};
\draw [->] (x1) to node [above] {X} (x2);
\end{tikzpicture}
\item If X is a token, then this transition corresponds to a shift of X from the
input to the top of the stack during a parse
\item if X is a nonterminal,
X will never appear as an input symbol

\begin{tikzpicture}
\node (x1) at (0,0) [circle] {$A\to\alpha\cdot X\eta$};
\node (x2) at (5,0) [circle] {$X\to\cdot\beta$};
\draw [->] (x1) to node [above] {$\epsilon$} (x2);
\end{tikzpicture}
\item The \textbf{start state} of the NFA ↔ the \textbf{initial state} of the parser: the stack is
empty
\item the solution is to augment the grammar by a single production S' -> S
\item \textbf{S'->·S} the \textbf{start state} of the NFA
\end{itemize}
