Compiler.org
*** The LR(0) parsing algorithm
    + the parsing stack to store: *symbols* and *state numbers*
    + pushing the new *state number* onto the parsing stack after each push of *a
      symbol*
    + Let s be the current state. Then actions are
      1. if state s contains any item of the form *A -> α·Xβ* (X is a terminal).
         Then the action is to shift the current input token onto the stack
      2. If state s contains any *complete item* (an item of the form *A->γ·*),
         then the action is to reduce by the rule *A->γ·*
         * A *reduction* by the rule *S'->S* where S' is the start state
         * *acceptance* if the input is empty
         * *Error* if the input is not empty
    + A grammar is *LR(0)* grammar if the above rules are unambiguous
    + A grammar is *LR(0)* iff
      * Each state is a shift state
      * A reduce state containing a single complete item
    + table
      | state | action | rule   | input | input | input | goto |
      |-------+--------+--------+-------+-------+-------+------|
      |       |        |        |     ( |     a | )     |    A |
      |     0 | shift  |        |     3 |     2 |       |    1 |
      |     1 | reduce | A'->A  |       |       |       |      |
      |     2 | reduce | A->(A) |       |       |       |      |
      |     3 | shift  |        |     3 |     2 |       |    4 |
      |     4 | shift  |        |       |       | 5     |      |
      |     5 | reduce | A->a   |       |       |       |      |
** SLR(1) Parsing (simple LR(1))
    + *definition*
      1. if state s contains any item of form $A\to\alpha\cdot X\beta$, then the
         action is to shift the current input token onto the stack, and the new
         state to be pushed on the stack is the state containing the item
         $A\to\alpha\cdot X\beta$ 
      2. if state s contains the complete item $A\to\gamma\cdot$, and _the next token in_
         _the input string is in Follow(A)_, then the action is to reduce by the
         rule $A\to\gamma$
         * A reduction by the rule *S'->S* where S' is the start state, this will
           happen only if the next input token is $
         * remove the string γ and all of its corresponding states from the parsing
           stack
         * back up in the DFA to the state from which the construction of γ begin
         * this state must contain an item of the form $B\to\alpha\cdot A\beta$.
           Push A to the stack, and push the state containing the item
           $B\to\alpha\cdot A\beta$ 
      3. if the next input token is s.t. neither of the above two cases applies,
         an error is declared
    + A grammar is *SLR(1)* iff for any state s
      1. for any item $A\to\alpha\cdot X\beta$ in s with X a terminal, there is no _complete_
         _item_ $B\to\gamma\cdot$ in s with X ∈ Follow(B)
      2. For any two complete item $A\to\alpha\cdot$ and $B\to\beta\cdot$ in s,
         $\text{Follow}(A)\cap\text{Follow(B)}=\emptyset$
    + right recursion can cause stack overflow
*** disambiguating rules for parsing conflicts
     + two kinds of parsing conflicts in SLR(1) parsing
       *shift-reduce* conflicts
       *reduce-reduce* conflicts
     + in the case of shift-reduce conflicts, there is a natural
       *disambiguaiting rule*: _always prefer shift over the reduce_
     + 
*** limits of SLR(1) parsing power
** General LR(1) and LALR(1) parsing

   + the difficulty with the SLR(1) method:
     applies lookaheads after the construction of the DFA of LR(0) items
   + An *LR(1)* item is a pair consisting of an *LR(0)* item and a *lookahead* token
   + *LR(1)* item as
     *[A->α·β, a]*
     A->α·β is LR(0) item, a is a token
   + *definition of LR(1) transitions* main difference of LR(0) and LR(1)
     *[A->α·Xγ, a]*, X is any symbol, there is a transition on X to
     *[A->αX·γ,a]*
     *[A->α·Bγ,a]*, B nonterminal, there are ε-transitions to items *[B->·β,b]*
     for every *B->β* and for every token b in *First(γa)*
*** Finite automata of LR(1) items
    + *start* state
      S'->S
    + start item

      *[S'->·S, $]*
*** The LR(1) parsing algorithm
    + the general LR(1) parsing algorithm
      Let s be the current state.
      
      1. s:[A->α·Xβ,a], X terminal, X is the next token in the input string *shift*
      2. s: [A->α·,a], the next token in the input string is a *reduce*
      3. otherwise error
    + A grammar is *LR(1)* iff for any state s
      1. for any item *[A->α·β,a]* in s with X a terminal, there is no item in s
         of the form *[B->γ·,X]* (otherwise there is a _shift-reduce_ conflict
      2. there are no two item in s of the form *[A->α·,a]* and *[B->β·,a]*
** LALR(1) parsing
   + the size of the DFA of sets of LR(1) items is too large
   + first principle of LAIR(1) parsing
     the core of a state of DFA of LR(1) is a state of the DFA of LR(0) items
   + second principle of LAIR(1) parsing
     s₁,s₂ of DFA of LR(1) that have the same core, suppose there is a transition
     on the symbol X from s₁ to a state t₁, then there is also a transition on X
     from state s₂ to a state t₂, and the states t₁ and t₂ have the same core
   + if a grammar is LR(1) then the LALR(1) parsing table cannot have any
     shift-reduce conflicts, there may be reduce-reduce conflicts
   + if a grammar is SLR(1), then it's LALR(1)
   + compute the DFA of LALR(1) items directly from the DFA of LR(0) items through
     a process of *propagating lookaheads*
** Error recovery in Bottom-up parsers
   A bottom-up parser will detect an error when a blank entry is detected
* chap6 semantics analysis
** Attributes and attribute grammars
   *attribute*: any property of a programming language constructs. May be fixed prior to
   the compilation process or be only determinable during program execution

   *binding* of the attribute: the process of computing an attribute and associating its
   computed value with the language construct in question

   *binding time*: the time during the compilation/execution process when the binding of
   an attribute occurs

   *static attributes/dynamic attributes*: based on the difference of the binding time

   *type checker*: an analyzer.
   computes the data type attribute of all language entities for which
   data types are defined. And verifies that these types conform to the type rules of
   the language

   *type checking*: set of rules that ensure the type consistency of different constructs
   in the program. e.g. operands types and so on
