latex/Compiler/Compiler.tex
\subsubsection{The LR(0) parsing algorithm}
\label{sec:org8fb73ef}
\begin{itemize}
\item the parsing stack to store: \textbf{symbols} and \textbf{state numbers}
\item pushing the new \textbf{state number} onto the parsing stack after each push of \textbf{a
symbol}
\item Let s be the current state. Then actions are
\begin{enumerate}
\item if state s contains any item of the form \textbf{A -> α·Xβ} (X is a terminal).
Then the action is to shift the current input token onto the stack
\item If state s contains any \textbf{complete item} (an item of the form \textbf{A->γ·}),
then the action is to reduce by the rule \textbf{A->γ·}
\begin{itemize}
\item A \textbf{reduction} by the rule \textbf{S'->S} where S' is the start state
\item \textbf{acceptance} if the input is empty
\item \textbf{Error} if the input is not empty
\end{itemize}
\end{enumerate}
\item A grammar is \textbf{LR(0)} grammar if the above rules are unambiguous
\item A grammar is \textbf{LR(0)} iff
\begin{itemize}
\item Each state is a shift state
\item A reduce state containing a single complete item
\end{itemize}
\item table
\begin{center}
\begin{tabular}{rllrrlr}
state & action & rule & input & input & input & goto\\
\hline
 &  &  & ( & a & ) & A\\
0 & shift &  & 3 & 2 &  & 1\\
1 & reduce & A'->A &  &  &  & \\
2 & reduce & A->(A) &  &  &  & \\
3 & shift &  & 3 & 2 &  & 4\\
4 & shift &  &  &  & 5 & \\
5 & reduce & A->a &  &  &  & \\
\end{tabular}
\end{center}
\end{itemize}
\subsection{SLR(1) Parsing (simple LR(1))}
\label{sec:org8d3c714}
\begin{itemize}
\item \textbf{definition}
\begin{enumerate}
\item if state s contains any item of form \(A\to\alpha\cdot X\beta\), then the
action is to shift the current input token onto the stack, and the new
state to be pushed on the stack is the state containing the item
\(A\to\alpha\cdot X\beta\)
\item if state s contains the complete item \(A\to\gamma\cdot\), and \uline{the next token in}
\uline{the input string is in Follow(A)}, then the action is to reduce by the
rule \(A\to\gamma\)
\begin{itemize}
\item A reduction by the rule \textbf{S'->S} where S' is the start state, this will
happen only if the next input token is \$
\item remove the string γ and all of its corresponding states from the parsing
stack
\item back up in the DFA to the state from which the construction of γ begin
\item this state must contain an item of the form \(B\to\alpha\cdot A\beta\).
Push A to the stack, and push the state containing the item
\(B\to\alpha\cdot A\beta\)
\end{itemize}
\item if the next input token is s.t. neither of the above two cases applies,
an error is declared
\end{enumerate}
\item A grammar is \textbf{SLR(1)} iff for any state s
\begin{enumerate}
\item for any item \(A\to\alpha\cdot X\beta\) in s with X a terminal, there is no \uline{complete}
\uline{item} \(B\to\gamma\cdot\) in s with X ∈ Follow(B)
\item For any two complete item \(A\to\alpha\cdot\) and \(B\to\beta\cdot\) in s,
\(\text{Follow}(A)\cap\text{Follow(B)}=\emptyset\)
\end{enumerate}
\item right recursion can cause stack overflow
\end{itemize}
\subsubsection{disambiguating rules for parsing conflicts}
\label{sec:org3539c67}
\begin{itemize}
\item two kinds of parsing conflicts in SLR(1) parsing
\textbf{shift-reduce} conflicts
\textbf{reduce-reduce} conflicts
\item in the case of shift-reduce conflicts, there is a natural
\textbf{disambiguaiting rule}: \uline{always prefer shift over the reduce}
\item 
\end{itemize}
\subsubsection{limits of SLR(1) parsing power}
\label{sec:org86e3a4e}
\subsection{General LR(1) and LALR(1) parsing}
\label{sec:orgafc2857}

\begin{itemize}
\item the difficulty with the SLR(1) method:
applies lookaheads after the construction of the DFA of LR(0) items
\item An \textbf{LR(1)} item is a pair consisting of an \textbf{LR(0)} item and a \textbf{lookahead} token
\item \textbf{LR(1)} item as
\textbf{[A->α·β, a]}
A->α·β is LR(0) item, a is a token
\item \textbf{definition of LR(1) transitions} main difference of LR(0) and LR(1)
\textbf{[A->α·Xγ, a]}, X is any symbol, there is a transition on X to
\textbf{[A->αX·γ,a]}
\textbf{[A->α·Bγ,a]}, B nonterminal, there are ε-transitions to items \textbf{[B->·β,b]}
for every \textbf{B->β} and for every token b in \textbf{First(γa)}
\end{itemize}
\subsubsection{Finite automata of LR(1) items}
\label{sec:org33c5d2b}
\begin{itemize}
\item \textbf{start} state
S'->S
\item start item

\textbf{[S'->·S, \$]}
\end{itemize}
\subsubsection{The LR(1) parsing algorithm}
\label{sec:org16bb762}
\begin{itemize}
\item the general LR(1) parsing algorithm
Let s be the current state.

\begin{enumerate}
\item s:[A->α·Xβ,a], X terminal, X is the next token in the input string \textbf{shift}
\item s: [A->α·,a], the next token in the input string is a \textbf{reduce}
\item otherwise error
\end{enumerate}
\item A grammar is \textbf{LR(1)} iff for any state s
\begin{enumerate}
\item for any item \textbf{[A->α·β,a]} in s with X a terminal, there is no item in s
of the form \textbf{[B->γ·,X]} (otherwise there is a \uline{shift-reduce} conflict
\item there are no two item in s of the form \textbf{[A->α·,a]} and \textbf{[B->β·,a]}
\end{enumerate}
\end{itemize}
\subsection{LALR(1) parsing}
\label{sec:org215f14b}
\begin{itemize}
\item the size of the DFA of sets of LR(1) items is too large
\item first principle of LAIR(1) parsing
the core of a state of DFA of LR(1) is a state of the DFA of LR(0) items
\item second principle of LAIR(1) parsing
s₁,s₂ of DFA of LR(1) that have the same core, suppose there is a transition
on the symbol X from s₁ to a state t₁, then there is also a transition on X
from state s₂ to a state t₂, and the states t₁ and t₂ have the same core
\item if a grammar is LR(1) then the LALR(1) parsing table cannot have any
shift-reduce conflicts, there may be reduce-reduce conflicts
\item if a grammar is SLR(1), then it's LALR(1)
\item compute the DFA of LALR(1) items directly from the DFA of LR(0) items through
a process of \textbf{propagating lookaheads}
\end{itemize}
\subsection{Error recovery in Bottom-up parsers}
\label{sec:orgcd7fb3e}
A bottom-up parser will detect an error when a blank entry is detected
\section{chap6 semantics analysis}
\label{sec:org8ded601}
\subsection{Attributes and attribute grammars}
\label{sec:org8978b98}
\textbf{attribute}: any property of a programming language constructs. May be fixed prior to
the compilation process or be only determinable during program execution

\textbf{binding} of the attribute: the process of computing an attribute and associating its
computed value with the language construct in question

\textbf{binding time}: the time during the compilation/execution process when the binding of
an attribute occurs

\textbf{static attributes/dynamic attributes}: based on the difference of the binding time

\textbf{type checker}: an analyzer.
computes the data type attribute of all language entities for which
data types are defined. And verifies that these types conform to the type rules of
the language

\textbf{type checking}: set of rules that ensure the type consistency of different constructs
in the program. e.g. operands types and so on
