Compiler.org
*** attribute grammars
    * $X.a$: the value of a associated to X
      
      $X$ is a grammar symbol and $a$ is an attribute associated to $X$
    * *syntax-directed semantics*: attributes are associated directly with the grammar
      symbols of the language
    * given attributes $a_1, a_2,...,a_k$ for each grammar rule 
      $X_0\to X_1\dots X_n$, the values of
      the attributes $X_i.a_j$ of each grammar symbol $X_i$ are related to the values of the
      attributes of the other symbols in the rule
    * an *attribute grammar*
      
      $X_i.a_j=f_{ij}(X_0.a_1,\dots,X_0.a_k,\dots,X_n.a_1,\dots,X_n.a_k)$
    * example
      
      For 
      \begin{grammar}
      <number> ::= <number> <digit> \alt <digit>

      <digit> ::= `[0123456789]'
      \end{grammar}
      | grammar rule                      | semantic rules                               |
      |-----------------------------------+----------------------------------------------|
      | $number1 \to number2 \; digit$    | $number1.val=number2.val\times 10+digit.val$ |
      | $number\to digit$                 | $number.val=digit.val$                       |
      | $digit\to 0$                      | $digit.val=0$                                |
      
      \begin{forest}
      qtree,
      [number\\(val=34*10+5=345)
       [number\\(val=3*10+4=34) 
        [number\\(val=3) 
         [digit\\(val=3) 
          [3]
         ]
        ]
        [digit\\(val=4) [4]]
       ]
       [digit\\(val=5) [5]]
      ]
      \end{forest}
*** simplifications and extensions to attribute grammars
    * *metalanguage* for the attribute grammar: the collection of expressions allowable in
      an attribute equation
    * *functions* can be added to the metalanguage whose definitions may be given elsewhere
    * *simplifications*
      1. using ambiguous grammar
      2. using abstract syntax tree instead of parse tree

** Algorithms for attribute computation
   purpose
   
   * each grammar rule choice has an *associated dependency graph*
   * an edge from Xₘ.aₖ to Xᵢ.aⱼ expressing the dependency of Xᵢ.aⱼ on Xₘ.aₖ
*** dependency graphs and evaluation order
    + *directed acyclic graphs* DAG
      topological sort
*** synthesized and inherited attributes
    + *synthesized attributes*
      * an attribute is synthesized if all its dependencies point from child to parent in
        the parse tree
      * *S-attributed grammar*
        an attribute grammar where all the attributes are synthesized
    + *inherited attributes*
      inheritance from parent to siblings, from siblings to siblings
*** The use of external data structures to store attributes values
    + Applicability
      * Not suitable to the method of *parameters* and *returned values*
      * particularly when the attribute values have significant structure
        and may be needed at arbitrary points during translation
      * Not reasonable to be stored in the syntax tree nodes
    + Ways:
      * external data structures: table, graphs and other data structures. One
        of the prime examples is the symbol table
      * replace attribute equations by calls to procedures representing
        operations on the appropriate data structure used to maintain the
        attribute values
*** The computation of attributes during parsing
    + *L-attributed*
      * An attribute grammar of $a_1,\dots,a_k$ is *L-attributed* if for each
        inherited attribute $a_j$ and each grammar rule $X_0\to X_1\dots X_n$
        the associated equations for a_j are
        $X_i.a_j=f_{ij}(X_0.a_1,\dots,X_0.a_k,X_1.a_1,\dots,X_1.a_k,\dots,X_{i-1}
        .a_1,\dots,X_{i-1}.a_k)$
    + *S-attributed grammar* is L-attributed
*** The dependence of attributes computation on the syntax
** The Symbol Table
   *semantic checks*

   | NAME | KIND | TYPE               | ATTRIBUTES |
   | foo  | fun  | int * int -> bool  | extern     |
   
   1. Linear list
   2. Various search tree structures
      AVL, B tree
   3. hash tables
      best choice
*** Declarations
    * constant declarations
    * type declarations
    * variable declarations
    * procedure/function declarations
*** Scope rules and block structure
** Data types and type checking
