latex/Compiler/Compiler.tex
\subsubsection{attribute grammars}
\label{sec:org98a4241}
\begin{itemize}
\item \(X.a\): the value of a associated to X

\(X\) is a grammar symbol and \(a\) is an attribute associated to \(X\)
\item \textbf{syntax-directed semantics}: attributes are associated directly with the grammar
symbols of the language
\item given attributes \(a_1, a_2,...,a_k\) for each grammar rule 
\(X_0\to X_1\dots X_n\), the values of
the attributes \(X_i.a_j\) of each grammar symbol \(X_i\) are related to the values of the
attributes of the other symbols in the rule
\item an \textbf{attribute grammar}

\(X_i.a_j=f_{ij}(X_0.a_1,\dots,X_0.a_k,\dots,X_n.a_1,\dots,X_n.a_k)\)
\item example

For 
\begin{grammar}
<number> ::= <number> <digit> \alt <digit>

<digit> ::= `[0123456789]'
\end{grammar}
\begin{center}
\begin{tabular}{ll}
grammar rule & semantic rules\\
\hline
\(number1 \to number2 \; digit\) & \(number1.val=number2.val\times 10+digit.val\)\\
\(number\to digit\) & \(number.val=digit.val\)\\
\(digit\to 0\) & \(digit.val=0\)\\
\end{tabular}
\end{center}

\begin{forest}
[]
\end{forest}
\end{itemize}
\subsubsection{simplifications and extensions to attribute grammars}
\label{sec:org629453a}
\begin{itemize}
\item \textbf{metalanguage} for the attribute grammar: the collection of expressions allowable in
an attribute equation
\item \textbf{functions} can be added to the metalanguage whose definitions may be given elsewhere
\item \textbf{simplifications}
\begin{enumerate}
\item using ambiguous grammar
\item using abstract syntax tree instead of parse tree
\end{enumerate}
\end{itemize}

\subsection{Algorithms for attribute computation}
\label{sec:orga156a94}
purpose

\begin{itemize}
\item each grammar rule choice has an \textbf{associated dependency graph}
\item an edge from Xₘ.aₖ to Xᵢ.aⱼ expressing the dependency of Xᵢ.aⱼ on Xₘ.aₖ
\end{itemize}
\subsubsection{dependency graphs and evaluation order}
\label{sec:orgec7a48e}
\begin{itemize}
\item \textbf{directed acyclic graphs} DAG
topological sort
\end{itemize}
\subsubsection{synthesized and inherited attributes}
\label{sec:org9aeb88b}
\begin{itemize}
\item \textbf{synthesized attributes}
\begin{itemize}
\item an attribute is synthesized if all its dependencies point from child to parent in
the parse tree
\item \textbf{S-attributed grammar}
an attribute grammar where all the attributes are synthesized
\end{itemize}
\item \textbf{inherited attributes}
inheritance from parent to siblings, from siblings to siblings
\end{itemize}
\subsubsection{The use of external data structures to store attributes values}
\label{sec:orgb222566}
\begin{itemize}
\item Applicability
\begin{itemize}
\item Not suitable to the method of \textbf{parameters} and \textbf{returned values}
\item particularly when the attribute values have significant structure
and may be needed at arbitrary points during translation
\item Not reasonable to be stored in the syntax tree nodes
\end{itemize}
\item Ways:
\begin{itemize}
\item external data structures: table, graphs and other data structures. One
of the prime examples is the symbol table
\item replace attribute equations by calls to procedures representing
operations on the appropriate data structure used to maintain the
attribute values
\end{itemize}
\end{itemize}
\subsubsection{The computation of attributes during parsing}
\label{sec:org3bad817}
\begin{itemize}
\item \textbf{L-attributed}
\begin{itemize}
\item An attribute grammar of \(a_1,\dots,a_k\) is \textbf{L-attributed} if for each
inherited attribute \(a_j\) and each grammar rule \(X_0\to X_1\dots X_n\)
the associated equations for a\(_{\text{j}}\) are
\(X_i.a_j=f_{ij}(X_0.a_1,\dots,X_0.a_k,X_1.a_1,\dots,X_1.a_k,\dots,X_{i-1}
        .a_1,\dots,X_{i-1}.a_k)\)
\end{itemize}
\item \textbf{S-attributed grammar} is L-attributed
\end{itemize}
\subsubsection{The dependence of attributes computation on the syntax}
\label{sec:org2f0fa84}
\subsection{The Symbol Table}
\label{sec:org7d48f16}
\textbf{semantic checks}

\begin{center}
\begin{tabular}{llll}
NAME & KIND & TYPE & ATTRIBUTES\\
foo & fun & int * int -> bool & extern\\
\end{tabular}
\end{center}

\begin{enumerate}
\item Linear list
\item Various search tree structures
AVL, B tree
\item hash tables
best choice
\end{enumerate}
\subsubsection{Declarations}
\label{sec:org397a9d8}
\begin{itemize}
\item constant declarations
\item type declarations
\item variable declarations
\item procedure/function declarations
\end{itemize}
\subsubsection{Scope rules and block structure}
\label{sec:org74ffefa}
\subsection{Data types and type checking}
\label{sec:org0bca174}
\end{document}